isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
    uint8_t resp[1] = { BL_CMD_JUMP };
    send_ack(resp, (uint16_t)sizeof(resp));

    /* Let the ACK drain onto the wire before we deinit peripherals. */
    HAL_Delay(10U);
    Bootloader_JumpToApplication();  /* never returns on success */
}

/* CMD_OB_READ: no args. Returns a 16-byte bl_ob_status_t snapshot. Not
 * session-gated — hosts need to be able to probe the current WRP mask
 * before opening a session so the provisioning UI can decide whether
 * OB_APPLY_WRP is needed. ACK payload is 17 bytes (opcode + record) →
 * one FF + two CFs over ISO-TP. */
static void handle_ob_read(uint8_t peer)
{
    bl_ob_status_t status;
    if (bl_obyte_read(&status) != BL_OB_OK) {
        send_nack(BL_CMD_OB_READ, BL_NACK_FLASH_HW);
        return;
    }

    uint8_t resp[1U + BL_OB_STATUS_SIZE];
    resp[0] = BL_CMD_OB_READ;
    memcpy(&resp[1], &status, BL_OB_STATUS_SIZE);
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_OB_APPLY_WRP: [token_le32, sector_bitmap_le32?]. Session-gated.
 *
 * This is a destructive, non-reversible operation on recent H7 silicon
 * (WRP is cleared only by a full chip erase via external debugger) so
 * the handler insists on the 4-byte BL_OB_APPLY_TOKEN confirmation
 * prefix. A stray frame without the token earns NACK(OB_WRONG_TOKEN),
 * never causes an accidental brick.
 *
 * The sector bitmap is optional. When omitted, the default is 0x01 —
 * protect the bootloader's own sector only, which is the common case
 * during provisioning. Bit N maps to sector N (H7x3 single-bank, 8
 * sectors).
 *
 * On success bl_obyte_apply_wrp calls HAL_FLASH_OB_Launch which resets
 * the MCU and never returns. The ACK is sent first with a short drain
 * delay; if the launch ever does return (documented edge case) we emit
 * NACK(FLASH_HW) so the host isn't left waiting. */
static void handle_ob_apply_wrp(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (!g_session_active) {
        send_nack(BL_CMD_OB_APPLY_WRP, BL_NACK_BAD_SESSION);
        return;
    }
    if (args_len < 4U) {
        send_nack(BL_CMD_OB_APPLY_WRP, BL_NACK_OB_WRONG_TOKEN);
        return;
    }

    uint32_t token = read_le32(&args[0]);
    if (token != BL_OB_APPLY_TOKEN) {
        bl_log_warn("OB_APPLY_WRP bad token 0x%08X", (unsigned int)token);
        send_nack(BL_CMD_OB_APPLY_WRP, BL_NACK_OB_WRONG_TOKEN);
        return;
    }

    uint32_t sector_bitmap = 0x01U;  /* default: protect bootloader sector */
    if (args_len >= 8U) {
        sector_bitmap = read_le32(&args[4]);
    }

    bl_log_warn("OB_APPLY_WRP committing mask=0x%08X (reset imminent)",
                (unsigned int)sector_bitmap);

    uint8_t resp[1] = { BL_CMD_OB_APPLY_WRP };
    send_ack(resp, (uint16_t)sizeof(resp));

    /* Drain the ACK before HAL_FLASH_OB_Launch yanks the MCU. */
    HAL_Delay(10U);

    bl_ob_rc_t rc = bl_obyte_apply_wrp(sector_bitmap);
    /* Only reachable if OB_Launch didn't reset — HAL flagged a program
     * failure. The session is gone either way; flag it to the host. */
    bl_dtc_log(BL_DTC_FLASH_HW, BL_DTC_SEV_ERROR, (uint32_t)rc);
    bl_log_error("OB_APPLY_WRP HAL failure rc=%d", (int)rc);
    send_nack(BL_CMD_OB_APPLY_WRP, BL_NACK_FLASH_HW);
}

/* Dispatch a completed ISO-TP message. byte 0 = opcode, remaining bytes
 * = opcode-specific args. Anything unknown earns NACK(UNSUPPORTED). */
static void handle_message(uint8_t peer,
                           uint8_t opcode,
                           const uint8_t *args,
                           uint16_t args_len)
{
    bl_live_note_opcode(opcode);

    switch (opcode) {
        case BL_CMD_CONNECT:
            handle_connect(peer, args, args_len);
            break;
        case BL_CMD_DISCONNECT:
            handle_disconnect(peer, args_len);
            break;
        case BL_CMD_DISCOVER:
            handle_discover(peer);
            break;
        case BL_CMD_GET_FW_INFO:
            handle_get_fw_info(peer);
            break;
        case BL_CMD_GET_HEALTH:
            handle_get_health(peer);
            break;
        case BL_CMD_FLASH_ERASE:
            handle_flash_erase(peer, args, args_len);
            break;
        case BL_CMD_FLASH_WRITE:
            handle_flash_write(peer, args, args_len);
            break;
        case BL_CMD_FLASH_READ_CRC:
            handle_flash_read_crc(peer, args, args_len);
            break;
        case BL_CMD_FLASH_VERIFY:
            handle_flash_verify(peer, args, args_len);
            break;
        case BL_CMD_LOG_STREAM_START:
            handle_log_stream_start(peer, args, args_len);
            break;
        case BL_CMD_LOG_STREAM_STOP:
            handle_log_stream_stop(peer);
            break;
        case BL_CMD_LIVE_DATA_START:
            handle_live_data_start(peer, args, args_len);
            break;
        case BL_CMD_LIVE_DATA_STOP:
            handle_live_data_stop(peer);
            break;
        case BL_CMD_DTC_READ:
            handle_dtc_read(peer);
            break;
        case BL_CMD_DTC_CLEAR:
            handle_dtc_clear(peer);
            break;
        case BL_CMD_NVM_READ:
            handle_nvm_read(peer, args, args_len);
            break;
        case BL_CMD_NVM_WRITE:
            handle_nvm_write(peer, args, args_len);
            break;
        case BL_CMD_NVM_FORMAT:
            handle_nvm_format(peer, args, args_len);
            break;
        case BL_CMD_OB_READ:
            handle_ob_read(peer);
            break;
        case BL_CMD_OB_APPLY_WRP:
            handle_ob_apply_wrp(peer, args, args_len);
            break;
        case BL_CMD_RESET:
            handle_reset(peer, args, args_len);
            break;
        case BL_CMD_JUMP:
            handle_jump(peer, args, args_len);
            break;
        default:
            send_nack(opcode, BL_NACK_UNSUPPORTED);
            break;
    }
}

/* ---- Public API ---- */

void bl_proto_dispatch(const bl_proto_id_t *id,
                       const uint8_t *data,
                       uint8_t length)
{
    /* Defence in depth behind the FDCAN filter: the filter already
     * rejects anything that isn't host→node and addressed to us, but
     * keep the software-level guard so unit tests and any future
     * software-routed code path (loopback harnesses, simulators)
     * stay correct. */
    if (id->direction != BL_PROTO_DIRECTION_HOST_TO_NODE
        || !bl_proto_addressed_to_us(id->node)
        || length == 0U) {
        return;
    }

    /* PCI gate: accept SF/FF (start of a new message) and CF/FC
     * (continuation / flow control of an in-flight one). Anything
     * else is malformed; silently drop. Under the fix/12 wire format
     * message type lives in the reassembled payload, not the ID, so
     * the PCI byte is the only thing we key on at the frame level. */
    uint8_t pci_hi = data[0] & BL_ISOTP_PCI_MASK_HI;
    if (pci_hi != BL_ISOTP_PCI_SF && pci_hi != BL_ISOTP_PCI_FF
        && pci_hi != BL_ISOTP_PCI_CF && pci_hi != BL_ISOTP_PCI_FC) {
        return;
    }

