isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
    /* Any frame that made it through the PCI gate counts as session
     * activity — including frames that end up getting NACKed. A host
     * that's still transmitting, even unsuccessfully, is still alive. */
    session_touch_activity();
    bl_live_frame_rx();

    /* `type` and `peer` args on bl_isotp_rx_feed are legacy
     * bookkeeping — the new wire format has exactly one peer (the
     * host, node 0x0) and no type-in-ID, so we pass constants. The
     * reassembler stores them for later inspection but no code path
     * in the new format actually reads them back.
     *
     * now_ms is passed through so the reassembler can arm its own
     * deadline on FF acceptance (fix/14 / issue #54). Before this the
     * dispatcher armed it externally right after send_fc_cts() — the
     * invariant lived in the caller, which left a footgun for any
     * future caller (e.g. unit tests, loopback simulators) that
     * forgot to stamp it. */
    bool                 send_fc = false;
    bl_isotp_rx_status_t st      = bl_isotp_rx_feed(&g_rx,
                                                     (uint8_t)BL_MSG_CMD,
                                                     BL_PROTO_NODE_HOST,
                                                     HAL_GetTick(),
                                                     data,
                                                     length,
                                                     &send_fc);

    if (send_fc) {
        send_fc_cts();
    }

    switch (st) {
        case BL_ISOTP_MSG_COMPLETE:
            /* Reassembled layout:
             *   g_rx.buf[0]   = msg_type
             *   g_rx.buf[1]   = opcode
             *   g_rx.buf[2..] = args
             *
             * Route by msg_type:
             *   CMD, DISCOVER_REQUEST → dispatch to handle_message
             *   APP_CTRL              → silently drop (BL transit)
             *   ACK / NACK / NOTIFY / DISCOVER_REPLY → silently drop
             *     (these are node→host types; seeing one here means
             *     either a malformed frame or a loopback harness
             *     feeding us our own TX — nothing actionable)
             *   unknown (>= 0x07)     → silently drop (reserved for
             *     future protocol extensions; keeping us quiet here
             *     lets the host adopt new types without breaking
             *     older BL firmware) */
            if (g_rx.received < 2U) {
                /* Need at least msg_type + opcode. Anything shorter
                 * is truncated; report it so the host can resync. */
                send_nack(0xFFU, BL_NACK_TRANSPORT_ERROR);
            } else {
                uint8_t msg_type_byte = g_rx.buf[0];
                uint8_t opcode        = g_rx.buf[1];
                const uint8_t *args   = &g_rx.buf[2];
                uint16_t       args_len = (uint16_t)(g_rx.received - 2U);

                switch (msg_type_byte) {
                    case BL_MSG_CMD:
                    case BL_MSG_DISCOVER_REQUEST:
                        handle_message(BL_PROTO_NODE_HOST,
                                       opcode,
                                       args,
                                       args_len);
                        break;

                    case BL_MSG_APP_CTRL:
                    case BL_MSG_ACK:
                    case BL_MSG_NACK:
                    case BL_MSG_NOTIFY:
                    case BL_MSG_DISCOVER_REPLY:
                    default:
                        /* Silent drop — see comment block above. */
                        break;
                }
            }
            bl_isotp_rx_init(&g_rx);
            break;

        case BL_ISOTP_OK:
            break;

        case BL_ISOTP_ERR_TIMEOUT:
            /* Only _tick returns this; _feed never does. Handle
             * defensively anyway. */
            send_nack(0xFFU, BL_NACK_TRANSPORT_TIMEOUT);
            bl_isotp_rx_init(&g_rx);
            break;

        default:
            send_nack(0xFFU, BL_NACK_TRANSPORT_ERROR);
            bl_isotp_rx_init(&g_rx);
            break;
    }
}

void bl_proto_tick(uint32_t now_ms)
{
    uint8_t peer = 0U;
    if (bl_isotp_rx_tick(&g_rx, now_ms, &peer)) {
        send_nack(0xFFU, BL_NACK_TRANSPORT_TIMEOUT);
    }

    /* Session watchdog — only runs while a session is active. Unsigned
     * subtraction wraps around the 32-bit HAL_GetTick roll-over
     * correctly: it measures elapsed milliseconds since the last
     * activity, not an absolute deadline. */
    if (g_session_active) {
        uint32_t elapsed = now_ms - g_session_last_activity_ms;
        if (elapsed >= BL_SESSION_TIMEOUT_MS) {
            session_timeout();
        }
    }
}

bool bl_proto_session_active(void)
{
    return g_session_active;
}

void bl_proto_send_notify(const uint8_t *payload, uint16_t length)
{
    /* NOTIFY always goes to the host. Unsolicited — does not
     * refresh the session watchdog. */
    send_message(BL_MSG_NOTIFY, payload, length);
}

uint32_t bl_proto_session_age_ms(uint32_t now_ms)
{
    if (!g_session_active) {
        return 0U;
    }
    return now_ms - g_session_last_activity_ms;
}

uint16_t bl_proto_isotp_rx_progress(void)
{
    return (g_rx.state == BL_ISOTP_STATE_WAIT_CF) ? (uint16_t)g_rx.received : 0U;
}
